print.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-01 Wed 21:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KU Print Installation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zehao Su" />
</head>
<body>
<div id="content">
<h1 class="title">KU Print Installation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org983cf1f">1. Before starting</a></li>
<li><a href="#org28a0b33">2. Check installation of CUPS</a></li>
<li><a href="#org6f2f164">3. Add KU printer</a></li>
<li><a href="#orgca520fb">4. Set authentication method</a></li>
</ul>
</div>
</div>

<div id="outline-container-org983cf1f" class="outline-2">
<h2 id="org983cf1f"><span class="section-number-2">1</span> Before starting</h2>
<div class="outline-text-2" id="text-1">
<p>
Think about whether you actually need the printers installed. If you 
don't care much about the print setup (long/short edge binding, 
margin, pages per side, etc.), then you can always use webprint on 
<a href="https://webprint.ku.dk">https://webprint.ku.dk</a>.
</p>
</div>
</div>

<div id="outline-container-org28a0b33" class="outline-2">
<h2 id="org28a0b33"><span class="section-number-2">2</span> Check installation of CUPS</h2>
<div class="outline-text-2" id="text-2">
<p>
CUPS is an acronym for Common UNIX Printing System which allows you 
to use your computer as a printer server. You can check if CUPS is 
installed on your machine by running
</p>

<div class="org-src-container">
<pre class="src src-sh">lpstat -r
</pre>
</div>

<p>
This command checks whether a scheduler is running.
</p>

<p>
If you don't have CUPS, you need to install it with
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install cups -y
</pre>
</div>

<p>
You need to run
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo systemctl start cups
sudo systemctl enable cups
</pre>
</div>

<p>
to start and enable CUPS services after successful installation.
</p>
</div>
</div>

<div id="outline-container-org6f2f164" class="outline-2">
<h2 id="org6f2f164"><span class="section-number-2">3</span> Add KU printer</h2>
<div class="outline-text-2" id="text-3">
<p>
N.B. You need to be within KU network to do this!
</p>

<p>
KU Print uses ipps for printer URI. To install a printer called 
<code>KU_MobilitytPrint</code>, run
</p>

<div class="org-src-container">
<pre class="src src-sh">lpadmin -p KU_MobilityPrint -E -v ipps://mobilityprint.ku.dk:9164/printers/ku_mobilityprint -m everywhere
</pre>
</div>

<p>
The <code>E</code> option enables the printer and accepts new print jobs. 
The <code>v</code> option specifies the printer URL. 
Finally, the <code>m</code> option sets up the printer driver. For KU printers, 
the generic <code>everywhere</code> driver should work.
</p>
</div>
</div>

<div id="outline-container-orgca520fb" class="outline-2">
<h2 id="orgca520fb"><span class="section-number-2">4</span> Set authentication method</h2>
<div class="outline-text-2" id="text-4">
<p>
Now you have the option to try printing any document from your 
computer. If the system prompts you to enter username and password, 
use your KU-id for login.
</p>

<p>
In case this doesn't work, you have to change the configuration of 
this printer manually.
</p>

<p>
First, you have to stop the CUPS service by running
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo service cups stop
</pre>
</div>

<p>
Then use any editor of your choice (e.g. gedit) to open the file
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo gedit /etc/cups/printers.conf
</pre>
</div>

<p>
You should find a chunk of text starting with 
<code>&lt;Printer KU_MobilityPrint&gt;</code>. Add under it on a new line: 
<code>AuthInfoRequired username,password</code>. Save and quit.
</p>

<p>
Restart CUPS
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo service cups restart
</pre>
</div>

<p>
Try printing any document again. You should be able to enter your 
login info on a pop-up window.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zehao Su</p>
<p class="date">Created: 2021-12-01 Wed 21:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
